In [9]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [10]:
df=pd.read_csv('car_prediction_data.csv')

In [11]:
df

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [12]:
#1 How to check the shape, size, and data types of a DataFrame?

In [13]:
df.shape[0]

301

In [14]:
df.shape[1]

9

In [15]:
df.size

2709

In [16]:
df.dtypes

Car_Name          object
Year               int64
Selling_Price    float64
Present_Price    float64
Kms_Driven         int64
Fuel_Type         object
Seller_Type       object
Transmission      object
Owner              int64
dtype: object

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 301 entries, 0 to 300
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Car_Name       301 non-null    object
 1   Year           301 non-null    int64
 2   Selling_Price  301 non-null    float64
 3   Present_Price  301 non-null    float64
 4   Kms_Driven     301 non-null    int64
 5   Fuel_Type      301 non-null    object
 6   Seller_Type    301 non-null    object
 7   Transmission   301 non-null    object
 8   Owner          301 non-null    int64
dtypes: float64(2), int64(3), object(4)
memory usage: 21.3+ KB

In [18]:
#2 how do you get the first and last 5 rows?

In [19]:
df.head()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0

In [20]:
df.tail()

,Car_Name,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
296,city,2016,9.50,11.6,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.9,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.0,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.5,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.9,5464,Petrol,Dealer,Manual,0

In [21]:
#3.how to rename columns in a Datafarme?
#df.columns.str.replace('Car_Name','CarName')
df.rename(columns={'Car_Name':'CarName'},inplace=True)

In [22]:
df.columns

Index(['CarName', 'Year', 'Selling_Price', 'Present_Price', 'Kms_Driven',
       'Fuel_Type', 'Seller_Type', 'Transmission', 'Owner'],
      dtype='object')

In [23]:
#4 how to reset and set the index of a DataFrame?
df.reset_index(drop=True,inplace=True) #ex:A:3,b:4==0:3,1:4(index change)
#df.set_index('column_name',inplace=True) #add=A:3,b:4

In [24]:
#5.How to detect and count missing values?
df.isnull().sum()

CarName          0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [25]:
#6.how to fill missing values with mean/median/model?
#df['Selling_Price'].fillna(df['Selling_Price'].mean(),inplace=True)
#df['Year'].fillna(df['Year'].median(),inplace=True)
#df['Owner'].fillna(df['Owner'].mode(),inplace=True)-----but no null values in table

In [26]:
#7 How to drop rows or columns with missing values? 
df.dropna(axis=0)

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [27]:
df.dropna(axis=1)

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [28]:
#8 How to detect and remove duplicates? 
df.drop_duplicates(inplace=True)

In [29]:
df

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [30]:
#9 How to replace values in a DataFrame? 
#df['Selling_Price'].replace({'Selling_Price':'sellingprice'},inplace=True)

In [32]:
#10 How to filter rows based on a condition? 
df[df['Selling_Price']>10]

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
50,fortuner,2012,14.90,30.61,104707,Diesel,Dealer,Automatic,0
51,fortuner,2015,23.00,30.61,40000,Diesel,Dealer,Automatic,0
52,innova,2017,18.00,19.77,15000,Diesel,Dealer,Automatic,0
53,fortuner,2013,16.00,30.61,135000,Diesel,Individual,Automatic,0
59,fortuner,2014,19.99,35.96,41000,Diesel,Dealer,Automatic,0
62,fortuner,2014,18.75,35.96,78000,Diesel,Dealer,Automatic,0
63,fortuner,2015,23.50,35.96,47000,Diesel,Dealer,Automatic,0
64,fortuner,2017,33.00,36.23,6000,Diesel,Dealer,Automatic,0
66,innova,2017,19.75,23.15,11000,Petrol,Dealer,Automatic,0
69,corolla altis,2016,14.25,20.91,12000,Petrol,Dealer,Manual,0
79,fortuner,2012,14.50,30.61,89000,Diesel,Dealer,Automatic,0
80,corolla altis,2016,14.73,14.89,23000,Diesel,Dealer,Manual,0
82,innova,2017,23.00,25.39,15000,Diesel,Dealer,Automatic,0
83,innova,2015,12.50,13.46,38000,Diesel,Dealer,Manual,0
86,land cruiser,2010,35.00,92.60,78000,Diesel,Dealer,Manual,0
91,innova,2014,11.25,16.09,58242,Diesel,Dealer,Manual,0
96,innova,2016,20.75,25.39,29000,Diesel,Dealer,Automatic,0
97,corolla altis,2017,17.00,18.64,8700,Petrol,Dealer,Manual,0
211,elantra,2015,11.75,14.79,43535,Diesel,Dealer,Manual,0
212,creta,2016,11.25,13.60,22671,Petrol,Dealer,Manual,0
232,elantra,2015,11.45,14.79,12900,Petrol,Dealer,Automatic,0
237,creta,2015,11.25,13.60,68000,Diesel,Dealer,Manual,0
250,creta,2016,12.90,13.60,35934,Diesel,Dealer,Manual,0
256,city,2016,10.25,13.60,49562,Petrol,Dealer,Manual,0
275,city,2016,10.90,13.60,30753,Petrol,Dealer,Automatic,0
289,city,2016,10.11,13.60,10980,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0

In [34]:
#11 How to filter rows using multiple conditions? 
df[(df['Selling_Price']>30)&(df['CarName']=='fortuner')]

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
64,fortuner,2017,33.0,36.23,6000,Diesel,Dealer,Automatic,0

In [38]:
#12 How to use isin() to filter values? 
df[df['Seller_Type'].isin(['Dealer','Individual'])]

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0
1,sx4,2013,4.75,9.54,43000,Diesel,Dealer,Manual,0
2,ciaz,2017,7.25,9.85,6900,Petrol,Dealer,Manual,0
3,wagon r,2011,2.85,4.15,5200,Petrol,Dealer,Manual,0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0
...,...,...,...,...,...,...,...,...,...
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0
298,city,2009,3.35,11.00,87934,Petrol,Dealer,Manual,0
299,city,2017,11.50,12.50,9000,Diesel,Dealer,Manual,0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0

In [42]:
#13How to detect and count missing values?
df.isnull().sum()

CarName          0
Year             0
Selling_Price    0
Present_Price    0
Kms_Driven       0
Fuel_Type        0
Seller_Type      0
Transmission     0
Owner            0
dtype: int64

In [43]:
#14 How to perform multiple aggregations?
df.groupby('Year').agg({'Selling_Price':['sum','mean']})

     Selling_Price
               sum      mean
Year
2003          2.60  1.300000
2004          1.50  1.500000
2005          9.95  2.487500
2006          5.75  1.437500
2007          0.32  0.160000
2008          7.02  1.002857
2009         16.90  2.816667
2010         78.94  5.262667
2011         45.13  2.375263
2012         88.35  3.841304
2013        116.85  3.540909
2014        180.96  4.762105
2015        338.55  5.642500
2016        252.91  5.161429
2017        217.32  6.209143
2018          9.25  9.250000

In [48]:
#15 How to get group size and count? 
df.groupby('Selling_Price').size()

Selling_Price
0.10     1
0.12     1
0.15     1
0.16     1
0.17     1
        ..
20.75    1
23.00    2
23.50    1
33.00    1
35.00    1
Length: 156, dtype: int64

In [51]:
df.groupby('Selling_Price').size().count()

156

In [53]:
#16 How to apply transformations to groups? 
df.groupby('Selling_Price')['Kms_Driven'].transform('mean')

0      57467.000000
1      42311.000000
2      24289.000000
3      10778.333333
4      42450.000000
           ...
296    33988.000000
297    51809.800000
298    57467.000000
299     9000.000000
300    10982.000000
Name: Kms_Driven, Length: 299, dtype: float64

In [69]:
#17 How to rank values within groups? 
df['Price_Rank']=df.groupby('Year')['Selling_Price'].rank(ascending=False)
#return output=descending order

In [67]:
df['Price_Rank']

0      13.0
1      22.0
2      25.0
3      11.0
4      21.0
       ...
296    41.0
297    20.0
298     4.0
299    30.0
300    27.0
Name: Price_Rank, Length: 299, dtype: float64

In [75]:
#18 How to filter rows based on date range?
df[(df['Year']>=2014)&(df['Year']<=2016)]

,CarName,Year,Selling_Price,Present_Price,Kms_Driven,Fuel_Type,Seller_Type,Transmission,Owner,Price_Rank
0,ritz,2014,3.35,5.59,27000,Petrol,Dealer,Manual,0,26.0
4,swift,2014,4.60,6.87,42450,Diesel,Dealer,Manual,0,18.0
6,ciaz,2015,6.75,8.12,18796,Petrol,Dealer,Manual,0,20.0
7,s cross,2015,6.50,8.61,33429,Diesel,Dealer,Manual,0,22.0
8,ciaz,2016,8.75,8.89,20273,Diesel,Dealer,Manual,0,12.0
...,...,...,...,...,...,...,...,...,...,...
294,amaze,2014,3.75,6.80,33019,Petrol,Dealer,Manual,0,24.0
295,city,2015,8.55,13.09,60076,Diesel,Dealer,Manual,0,9.0
296,city,2016,9.50,11.60,33988,Diesel,Dealer,Manual,0,9.0
297,brio,2015,4.00,5.90,60000,Petrol,Dealer,Manual,0,41.0
300,brio,2016,5.30,5.90,5464,Petrol,Dealer,Manual,0,23.0

In [79]:
#19 How to create new columns based on other columns? 
df['total']=df['Present_Price']*df['Selling_Price']

In [80]:
df['total']

Year
2014     18.7265
2013     45.3150
2017     71.4125
2011     11.8275
2014     31.6020
          ...
2016    110.2000
2015     23.6000
2009     36.8500
2017    143.7500
2016     31.2700
Name: total, Length: 299, dtype: float64

In [108]:
#20 How to use np.where() for conditional columns? 
df['grade']=np.where(df['Selling_Price']>=4.0,'A','B')

In [109]:
df['grade']

Year
2014    B
2013    A
2017    A
2011    B
2014    A
       ..
2016    A
2015    A
2009    B
2017    A
2016    A
Name: grade, Length: 299, dtype: object

In [132]:
data={'name':['nme rty','er rty','te tyy']}

In [133]:
s=pd.DataFrame(data)

In [134]:
s

      name
0  nme rty
1   er rty
2   te tyy

In [135]:
#21 How to apply string methods to a column? 
s['name'].str.split(' ',expand=True)

     0    1
0  nme  rty
1   er  rty
2   te  tyy

In [136]:
s.set_index('name',inplace=True)

In [138]:
s.reset_index('name',inplace=True)

In [146]:
s['name'].str.split(' ',expand=True)

     0    1
0  nme  rty
1   er  rty
2   te  tyy

In [142]:
s

      name  0
0  nme rty  A
1   er rty  A
2   te tyy  A

In [151]:
#22 How to calculate correlation between features? 
df['Selling_Price'].corr(df['Present_Price'])

0.8763781800609988

In [155]:
#23 How to detect outliers using IQR?
def iqr(q1,q3):
    return q3-q1
q1=df['Selling_Price'].quantile(0.25)
q2=df['Selling_Price'].quantile(0.75)
print(iqr(q1,q3))

NameError: name 'q3' is not defined